Tester/src/Catalogs/Scenarios/Scenarios.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scenarios</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Access</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Application</name>
    <type>
      <types>CatalogRef.Applications</types>
    </type>
  </attributes>
  <attributes>
    <name>Changed</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>LastCreator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Local</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Path</name>
    <type>
      <types>DefinedType.ScenarioPath</types>
    </type>
  </attributes>
  <attributes>
    <name>Script</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Severity</name>
    <type>
      <types>EnumRef.Severity</types>
    </type>
  </attributes>
  <attributes>
    <name>Sorting</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Spreadsheet</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Tag</name>
    <type>
      <types>CatalogRef.TagKeys</types>
    </type>
  </attributes>
  <attributes>
    <name>Template</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Tree</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.Scenarios</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Areas</name>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Top</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Left</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Bottom</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Right</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Users</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/InformationRegisters/Editing/Editing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Editing</name>
  <resources>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </resources>
  <resources>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Scenario</name>
    <type>
      <types>CatalogRef.Scenarios</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester/src/InformationRegisters/Versions/Versions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Versions</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Memo</name>
    <type>
      <types>DefinedType.VersionMemo</types>
    </type>
  </resources>
  <resources>
    <name>Version</name>
    <type>
      <types>CatalogRef.Versions</types>
    </type>
  </resources>
  <dimensions>
    <name>Scenario</name>
    <type>
      <types>CatalogRef.Scenarios</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester/src/Catalogs/Scenarios/Forms/Unlock/Module.bsl
&AtServer
var ActualScenarios;
&AtServer
var LastVersions;

// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	LockingForm.LoadScenarios ( ThisObject );
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure OK ( Command )
	
	if ( nothing () ) then
		Close ();
	else
		Output.UnlockConfirmation ( ThisObject );
	endif; 
	
EndProcedure

&AtClient
Function nothing ()
	
	for each row in List do
		if ( row.Use ) then
			return false;
		endif; 
	enddo; 
	return false;
	
EndFunction 

&AtClient
Procedure UnlockConfirmation ( Answer, Params ) export
	
	if ( Answer = DialogReturnCode.No ) then
		return;
	endif; 
	restored = unlock ();
	broadcast ( restored );
	Close ();
	
EndProcedure 

&AtServer
Function unlock ()
	
	table = LockingForm.FetchScenarios ( ThisObject );
	BeginTransaction ();
	LockingForm.LockEditing ( table );
	userScenarios ( table );
	restored = rollbackScenarios ();
	unlockScenarios ();
	CommitTransaction ();
	return restored;
	
EndFunction

&AtServer
Procedure userScenarios ( Table )
	
	s = "
	|select Editing.Scenario as Scenario
	|into UserScenarios
	|from InformationRegister.Editing as Editing
	|where Editing.Scenario in ( &Scenarios )
	|and Editing.User = &User
	|index by Scenario
	|;
	|// Actual scenarios
	|select UserScenarios.Scenario as Scenario
	|from UserScenarios as UserScenarios
	|;
	|// Last versions
	|select Versions.Scenario as Scenario, Versions.Version as Version
	|from InformationRegister.Versions.SliceLast ( , Scenario in ( select Scenario from UserScenarios ) ) as Versions
	|";
	q = new Query ( s );
	q.SetParameter ( "User", SessionParameters.User );
	q.SetParameter ( "Scenarios", Table.UnloadColumn ( "Ref" ) );
	data = q.ExecuteBatch ();
	ActualScenarios  = data [ 1 ].Unload ().UnloadColumn ( "Scenario" );
	LastVersions  = data [ 2 ].Unload ();

EndProcedure 

&AtServer
Function rollbackScenarios ()
	
	restored = new Array ();
	for each row in LastVersions do
		scenario = row.Scenario;
		Catalogs.Scenarios.Rollback ( scenario, row.Version );
		restored.Add ( scenario );
	enddo; 
	return restored;

EndFunction

&AtServer
Procedure unlockScenarios ()
	
	for each scenario in ActualScenarios do
		r = InformationRegisters.Editing.CreateRecordManager ();
		r.Scenario = scenario;
		r.Delete ();
	enddo; 
	
EndProcedure

&AtClient
Procedure broadcast ( Scenarios )
	
	Notify ( Enum.MessageReload (), Scenarios );
	NotifyChanged ( Type ( "CatalogRef.Scenarios" ) );
	
EndProcedure 

// *****************************************
// *********** Table List

&AtClient
Procedure ListBeforeAddRow ( Item, Cancel, Clone, Parent, Folder, Parameter )
	
	Cancel = true;
	
EndProcedure

&AtClient
Procedure ListBeforeDeleteRow ( Item, Cancel )
	
	Cancel = true;
	
EndProcedure
